#include "Interface.hpp"

int main(){
    Menu();
}

// [O] - сделано, [X] - не сделано, [O|X] - частично сделано.
// [X] графический интерфейс добавить
// [X] Ctrl F поиск
// [X] Открытие файлачерез интерфейс
// [O] чтение: добавить опцию чтения блоками + чтение всего файла
// [O] добавить сравнение по времени для этих методов
// [O] переделать названия на более корректны (например, buffer_capacity, bufferRefill, readchar)
// [O] вынести вспомогательные функции в отельный файл
// [O] original -> substr, str -> pattern
// [O] поправить отработку конца строки В поиске
// [O] сдвиг сразу на нужную позицию
// [O] Сдвиг не тот, сдвиг по перрвому символу